  # Challenge

  ## Identifying Outliers using Standard Deviation

In [1]:
# initial imports
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [2]:
# create a connection to the database
#engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_detection")

In [3]:
engine = create_engine("postgresql://postgres:Tx003677@localhost:5432/TransDB")

In [4]:
# code a function to identify outliers based on standard deviation
query = "SELECT t.id, t.date, t.amount, cc.id_card_holder FROM transaction as t INNER JOIN credit_card as cc ON t.card = cc.card;"

transaction_df = pd.read_sql(query, engine)

transaction_df.head()

     id                date  amount  id_card_holder
0   222 2018-01-01 21:35:10    6.22              13
1  2045 2018-01-01 21:43:12    3.83              13
2   395 2018-01-01 22:41:21    9.61              10
3  3309 2018-01-01 23:13:30   19.03               4
4   567 2018-01-01 23:15:10    2.95              18

In [5]:
transaction_df.sort_values("id_card_holder", axis = 0, ascending = True, inplace = True, na_position ='last')

transaction_df

        id                date  amount  id_card_holder
3164  1947 2018-11-25 01:27:57    2.99               1
274   1914 2018-01-29 06:32:49   10.24               1
2784  2138 2018-10-16 04:28:49    5.13               1
2768   984 2018-10-13 17:11:10   11.87               1
1561   816 2018-06-08 13:48:44    1.98               1
...    ...                 ...     ...             ...
920    294 2018-04-02 01:50:15    7.08              25
922   2616 2018-04-02 18:34:50   17.15              25
3386  1783 2018-12-19 10:41:34   10.14              25
167   2662 2018-01-18 12:41:06   15.86              25
1989  2425 2018-07-22 01:03:31    1.20              25

[3500 rows x 4 columns]

In [6]:
# Cal std diviation of the whole, then standard diviation of each id_card_holder?
df_std = np.std(transaction_df['amount'], axis = 0)
df_std

202.01405685944746

In [7]:
# def transactions_std(df):
#     std_list = []
#     index = 1
#     for i in range(25):
#         df1 = df.loc[df.id_card_holder == index]
#         std = np.std(df1['amount'], axis = 0)
#         std_list.append(std)
#         index += 1

# transactions_std(transaction_df)
# std_list

In [8]:
std_list = []
index = 1
for i in range(25):
    df1 = transaction_df.loc[transaction_df.id_card_holder == index]
    std = np.std(df1['amount'], axis = 0)
    std_list.append(std)
    index += 1
std_list

[359.7545898328081,
 5.513144380765574,
 326.5044330799175,
 5.7318390093056095,
 5.867147977318716,
 389.75646042993947,
 313.4179132170743,
 5.650150727932679,
 426.72666804936097,
 5.679574230791663,
 5.676219384490442,
 282.987590629633,
 5.894646398404297,
 6.508787971048912,
 5.828125280196329,
 288.11405953892404,
 5.588404722949764,
 323.4911828126586,
 5.586977275267951,
 5.569323529067831,
 5.818598256977116,
 5.340399154754324,
 5.655602881760807,
 214.6966222992641,
 307.47117997219686]

In [9]:
std_list2 = []
mean_lst2 = []
index_lst = []

In [10]:
index = 19
for i in range(19, 26, 3):
    df1 = transaction_df.loc[transaction_df.id_card_holder == index]
    std = np.std(df1['amount'], axis = 0)
    std_list2.append(std)
    index_lst.append(index)
    index += 3

std_list2

[5.586977275267951, 5.340399154754324, 307.47117997219686]

In [11]:
index = 19
for i in range(19, 26, 3):
    df1 = transaction_df.loc[transaction_df.id_card_holder == index]
    std = np.mean(df1['amount'], axis = 0)
    mean_lst2.append(std)
    index += 3

mean_lst2

[8.920731707317076, 8.785820895522388, 95.55185483870962]

In [12]:
index_lst

[19, 22, 25]

In [13]:
std_dict = {index_lst[i]: std_list2[i] for i in range(len(index_lst))}
std_dict

{19: 5.586977275267951, 22: 5.340399154754324, 25: 307.47117997219686}

In [14]:
# find anomalous transactions for 3 random card holders
df22 = transaction_df.loc[transaction_df.id_card_holder == 22]
df22

        id                date  amount  id_card_holder
3197  1016 2018-11-28 23:54:41   10.14              22
2566    24 2018-09-25 12:45:03    5.99              22
1165  3441 2018-04-27 18:19:37    1.97              22
370   2085 2018-02-08 08:36:01    2.48              22
440    891 2018-02-15 14:49:29   10.01              22
...    ...                 ...     ...             ...
3221   476 2018-12-01 13:28:12    3.23              22
2621  2329 2018-09-30 11:39:26    4.67              22
675   3197 2018-03-09 11:41:54   15.72              22
2748  3334 2018-10-11 22:29:56    2.95              22
21    1077 2018-01-03 18:16:55   10.27              22

[67 rows x 4 columns]

In [15]:
df22 = df22.drop(['id_card_holder'], axis = 1)
df22.dtypes

id                 int64
date      datetime64[ns]
amount           float64
dtype: object

In [16]:
df22_max100 = df22.drop(['date'], axis = 1)
df22_max100.sort_values('amount', axis = 0, ascending = False, inplace = True)
df22_max100 = df22_max100.head(100)

In [17]:
df22_max100.head(12)
#get transaction info for 1684, 636, 296, 1510, 3375, 960, 1306, 2223, 1541

        id  amount
889   3106   19.87
2705  3047   19.55
2791  2706   19.00
2983  3249   18.35
736   2790   18.35
804   2966   18.18
26    2922   17.59
1102  2587   16.91
675   3197   15.72
2598  3215   15.22
471   2683   14.91
3030  3229   14.03

In [18]:
df22['hour_of_timestamp'] = df22['date'].dt.hour
df22 = df22.drop(['date'], axis = 1)
df22.sort_values('hour_of_timestamp', axis = 0, ascending = True, inplace = True, na_position ='last')
df22

        id  amount  hour_of_timestamp
394    206    7.51                  0
2492   237    4.79                  0
3494  1578   10.01                  1
35    1995    5.09                  1
2358  1870   10.72                  2
...    ...     ...                ...
3367  1671   10.60                 23
1264  1900   10.52                 23
2250   362    3.22                 23
1334   904   10.08                 23
3197  1016   10.14                 23

[67 rows x 3 columns]

In [19]:
df22_hour = df22[(df22['hour_of_timestamp'] > 6) & (df22['hour_of_timestamp'] < 9)]
df22_hour = df22_hour.drop(['hour_of_timestamp'], axis = 1)
df22_hour

        id  amount
2419  1330   10.38
370   2085    2.48
854    204    6.20

In [20]:
#less then $2
df22_lessthan2 = df22_hour[(df22_hour['amount'] < 2)]
df22_lessthan2

Empty DataFrame
Columns: [id, amount]
Index: []

In [21]:
# get merchant from id 640
print('Customer 22 has no suspicious transactions.')

Customer 22 has no suspicious transactions.

In [22]:
# #list19 = [x for x in df19 if (x > mean_lst2[0] - (2 * std_list2[0]))]
# df22_an = [x for x in df19 if (x > (8.920731707317076 - 2 * 5.586977275267951))]
# df22_hour

  ## Identifying Outliers Using Interquartile Range

In [23]:
# # code a function to identify outliers based on interquartile range
# #25 75 method
# q25 = percentile(df, 25)
# q75 = percentile(df, 75)
# iqr = q75 - q25
# cut_off = iqr * 1.5
# lower = q25 - cut_off
# upper = q75 + cut_off
# outliers = [x for x in df if x < lower or x > upper]
# lst_wo_out = [x for x in df if x > lower or x < upper]

In [24]:
# find anomalous transactions for 3 random card holders